app/views/users/_form.html.erb

SELECT "user_types".* FROM "user_types"
---
    <%= form.label :user_type_id %>
    <%= form.collection_select(:user_type_id , UserType.all, :id, :nombre) %>