app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("user_type_id", "email", "crypted_password", "salt", "nombre", "apellido_paterno", "apellido_materno", "dni", "fecha_nacimiento", "celular", "direccion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)